In [1]:
import pandas as pd
import numpy as np

### Loading Data

In [ ]:
# Reading a CSV file
# df = pd.read_csv('data.csv')
# With custom separator and encoding
# df = pd.read_csv('data.csv', sep=';', encoding='utf-8')

In [ ]:
# Reading an Excel file
# df = pd.read_excel('data.xlsx', sheet_name='Sheet1')

In [ ]:
# Reading a JSON file
# df = pd.read_json('data.json')

### DataFrames

In [3]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'MSRP'
]

In [5]:
df = pd.DataFrame(data, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [8]:
data_2 = [
    {
        "Make": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "MSRP": 2000
    },
    {
        "Make": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "MSRP": 27150
    },
    {
        "Make": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "MSRP": 54990
    },
    {
        "Make": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "MSRP": 34450
    },
    {
        "Make": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "MSRP": 32340
    }
]

In [10]:
df_2 = pd.DataFrame(data_2)
df_2

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [11]:
df.head(2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

### Inspecting Data

In [ ]:
# Get information about the dataframe (columns, data types, memory usage)
df.info()

In [ ]:
# Check data types of each column
df.dtypes

In [ ]:
# Count missing values in each column
df.isnull().sum()

### Series

In [12]:
df.Make

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [13]:
df["Make"]

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Make, dtype: object

In [14]:
df[["Make", "Model", "MSRP"]]

      Make     Model   MSRP
0   Nissan    Stanza   2000
1  Hyundai    Sonata  27150
2    Lotus     Elise  54990
3      GMC    Acadia  34450
4   Nissan  Frontier  32340

In [15]:
df["id"] = [1, 2, 3, 4, 5]

In [16]:
df["id"]

0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64

In [17]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df.loc[[1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2

In [23]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [24]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [25]:
df.loc['a']

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
id                        1
Name: a, dtype: object

In [26]:
df.loc[['a']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1

In [27]:
df.loc[['a', 'b']]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2

In [28]:
df.iloc[1]

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
id                           2
Name: b, dtype: object

In [29]:
df.iloc[[0, 1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2

In [30]:
df.reset_index(drop=True)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [31]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

### Element-wise Operations

In [32]:
df['Engine HP'] / 100

a    1.38
b     NaN
c    2.18
d    1.94
e    2.61
Name: Engine HP, dtype: float64

In [33]:
df['Year'] >= 2015

a    False
b     True
c    False
d     True
e     True
Name: Year, dtype: bool

In [34]:
df[df['Year'] >= 2015]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [35]:
df[df['Make'] == "Nissan"]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [37]:
df[(df['Make'] == "Nissan") & (df['Year'] >= 2015)]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

### String Operators

In [39]:
df["Vehicle_Style"].str.lower()

a          sedan
b          sedan
c    convertible
d        4dr suv
e         pickup
Name: Vehicle_Style, dtype: object

In [40]:
df["Vehicle_Style"].str.replace(" ", "_")

a          sedan
b          Sedan
c    convertible
d        4dr_SUV
e         Pickup
Name: Vehicle_Style, dtype: object

In [41]:
df["Vehicle_Style"].str.replace(" ", "_").str.lower()

a          sedan
b          sedan
c    convertible
d        4dr_suv
e         pickup
Name: Vehicle_Style, dtype: object

### Feature Engineering

In [ ]:
# Create a new column
df['Age'] = 2024 - df['Year']
df[['Year', 'Age']].head(3)

In [ ]:
# Vectorized math operations
df['Price_per_HP'] = df['MSRP'] / df['Engine HP']
df[['MSRP', 'Engine HP', 'Price_per_HP']].head(3)

In [ ]:
# Binning: cut() for equal-width bins
df['HP_Category'] = pd.cut(df['Engine HP'], bins=[0, 150, 250, 350], labels=['Low', 'Medium', 'High'])
df[['Engine HP', 'HP_Category']].head(3)

In [ ]:
# Binning: qcut() for equal-frequency bins (quantiles)
df['MSRP_Quartile'] = pd.qcut(df['MSRP'], q=4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
df[['MSRP', 'MSRP_Quartile']].head(3)

### Summarising Operation

In [42]:
df.MSRP.max()

np.int64(54990)

In [44]:
df['MSRP'].mean()

np.float64(30186.0)

In [46]:
df['MSRP'].describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [48]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders      MSRP    id
count     5.00       4.00              5.00      5.00  5.00
mean   2010.40     202.75              4.40  30186.00  3.00
std      11.26      51.30              0.89  18985.04  1.58
min    1991.00     138.00              4.00   2000.00  1.00
25%    2010.00     180.00              4.00  27150.00  2.00
50%    2017.00     206.00              4.00  32340.00  3.00
75%    2017.00     228.75              4.00  34450.00  4.00
max    2017.00     261.00              6.00  54990.00  5.00

In [50]:
df["Make"].nunique()

4

### Missing Values

In [54]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
a,False,False,False,False,False,False,False,False,False
b,False,False,False,True,False,False,False,False,False
c,False,False,False,False,False,False,False,False,False
d,False,False,False,False,False,False,False,False,False
e,False,False,False,False,False,False,False,False,False

In [55]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
id                   0
dtype: int64

### Cleaning & Preprocessing

In [ ]:
# Drop rows with missing values
df.dropna()

In [ ]:
# Fill missing values with a specific value
df.fillna(0)

In [ ]:
# Convert column to different data type
df.astype({'Year': 'int64', 'MSRP': 'float64'})

In [ ]:
# Rename columns
df.rename(columns={'Engine HP': 'Horsepower', 'MSRP': 'Price'})

In [ ]:
# Remove duplicate rows
df.drop_duplicates()

In [ ]:
# Clean and standardize strings
df['Vehicle_Style'] = df['Vehicle_Style'].str.strip().str.lower()

### Grouping

In [60]:
df.groupby("Transmission Type")["MSRP"].max()

Transmission Type
AUTOMATIC    34450
MANUAL       54990
Name: MSRP, dtype: int64

In [61]:
df.groupby("Transmission Type").MSRP.max()

Transmission Type
AUTOMATIC    34450
MANUAL       54990
Name: MSRP, dtype: int64

In [ ]:
# Using agg() for multiple aggregations
df.groupby("Transmission Type")["MSRP"].agg(['mean', 'min', 'max', 'count'])

In [ ]:
# Multi-level aggregations
df.groupby(["Transmission Type", "Make"])["MSRP"].mean()

In [ ]:
# Pivot table: aggregate data by multiple columns
df.pivot_table(values='MSRP', index='Make', columns='Transmission Type', aggfunc='mean')

### Getting the NumPy Arrays

In [62]:
df.MSRP.values

array([ 2000, 27150, 54990, 34450, 32340])

In [63]:
df.to_dict(orient='records')

[{'Make': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'sedan',
  'MSRP': 2000,
  'id': 1},
 {'Make': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'Sedan',
  'MSRP': 27150,
  'id': 2},
 {'Make': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'convertible',
  'MSRP': 54990,
  'id': 3},
 {'Make': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4dr SUV',
  'MSRP': 34450,
  'id': 4},
 {'Make': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'Pickup',
  'MSRP': 32340,
  'id': 5}]

### Exporting Data

In [ ]:
# Export to CSV
# df.to_csv('output.csv', index=False)

In [ ]:
# Export to Excel
# df.to_excel('output.xlsx', index=False, sheet_name='Data')

In [ ]:
# Export to JSON
# df.to_json('output.json', orient='records')

### Time Series

In [ ]:
# Convert to datetime
dates = pd.Series(['2020-01-15', '2021-03-20', '2022-06-10'])
pd.to_datetime(dates)

In [ ]:
# Create a datetime index and resample
ts_df = pd.DataFrame({'value': [10, 20, 30, 40, 50]}, 
                      index=pd.date_range('2024-01-01', periods=5, freq='D'))
ts_df.resample('2D').mean()

### Reshaping

In [ ]:
# Pivot: reshape data from long to wide format
pivot_df = df.pivot_table(values='MSRP', index='Make', columns='Transmission Type')
pivot_df

In [ ]:
# Melt: reshape data from wide to long format
melted = df[['Make', 'Model', 'Year', 'MSRP']].head(2)
pd.melt(melted, id_vars=['Make', 'Model'], value_vars=['Year', 'MSRP'])

In [ ]:
# Sort values by column
df.sort_values('MSRP', ascending=False).head(3)

In [ ]:
# Sort by index
df.sort_index(ascending=False).head(3)

### Merging & Joining

In [ ]:
# Merge (SQL-style joins)
df1 = df[['Make', 'Model', 'MSRP']].head(3)
df2 = df[['Make', 'Model', 'Year']].head(3)
pd.merge(df1, df2, on=['Make', 'Model'])

In [ ]:
# Concatenate (stacking) dataframes
df_part1 = df.iloc[0:2]
df_part2 = df.iloc[2:4]
pd.concat([df_part1, df_part2], ignore_index=True)